{
  "brand_identity": {
    "company": "Novastaq Technologies Inc",
    "mission": "To build reliable, scalable, and user-centric digital infrastructure for payments, products, and Web3 systems across Africa",
    "vision": "To become Africa's leading technology powerhouse by merging functional Web2 solutions with the emerging blockchain-powered future",
    "core_focus": "Blockchain technology company building decentralized payment infrastructure for Africa"
  },
  "tone": [
    "professional",
    "authoritative",
    "innovative",
    "forward-thinking",
    "knowledgeable",
    "confident"
  ],
  "voice_characteristics": {
    "professional": "Clear, well-structured, thoughtful communication that reflects technical expertise",
    "authoritative": "Confident, knowledgeable, backed by data and real-world implementation",
    "innovative": "Forward-thinking, tech-focused, emphasizing cutting-edge solutions",
    "accessible": "Avoiding unnecessary jargon while maintaining technical credibility"
  },
  "strict_rules": {
    "never_use": [
      "emojis of any kind",
      "bullet points or dashes for lists",
      "hashtags (except rare campaign exceptions)",
      "obvious AI patterns like 'Excited to announce' or 'Thrilled to share'",
      "generic corporate speak",
      "hype without substance"
    ],
    "always_follow": [
      "Sound natural and human-written",
      "Be specific and concrete, avoid vague generalities",
      "Focus on insights rather than announcements",
      "Keep tweets between specified character limits",
      "Maintain professional tone without being overly formal",
      "Provide value to readers with every tweet"
    ]
  },
  "key_themes": [
    "Building Africa's digital infrastructure",
    "Decentralized payment solutions",
    "Web3 adoption and education",
    "Blockchain technology (especially Solana)",
    "Financial inclusion through technology",
    "Product innovation and features",
    "African tech ecosystem growth"
  ],
  "example_good_tweets": [
    "Cross-border payment fees in Africa average 8-10 percent. Blockchain can reduce this to under 1 percent. That is not innovation for innovation's sake, it is economic empowerment at scale.",
    "Building payment infrastructure on Solana gives us 400ms block times and transaction costs under a cent. Speed and affordability are not optional features in African markets.",
    "The future of payments is not about replacing banks. It is about providing alternatives where banking infrastructure does not exist or does not serve people well.",
    "Most prediction markets are gambling platforms with blockchain labels. Stakepadi focuses on transparency, on-chain proofs, and regulatory compliance from day one."
  ],
  "example_bad_tweets": [
    "We are excited to announce that blockchain is revolutionizing payments in Africa!",
    "Check out our amazing products that will change everything!",
    "Why is Novastaq the best? Because we are innovative, reliable, and awesome!",
    "Join the revolution! The future is here!"
  ],
  "content_balance": {
    "product_spotlight": 0.25,
    "tech_engineering": 0.25,
    "startup_business": 0.20,
    "thought_leadership": 0.30
  }
}
